/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_di_sparse {
    pub nzmax: i32,
    pub m: i32,
    pub n: i32,
    pub p: *mut i32,
    pub i: *mut i32,
    pub x: *mut f64,
    pub nz: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cs_di_sparse"][::std::mem::size_of::<cs_di_sparse>() - 48usize];
    ["Alignment of cs_di_sparse"][::std::mem::align_of::<cs_di_sparse>() - 8usize];
    ["Offset of field: cs_di_sparse::nzmax"][::std::mem::offset_of!(cs_di_sparse, nzmax) - 0usize];
    ["Offset of field: cs_di_sparse::m"][::std::mem::offset_of!(cs_di_sparse, m) - 4usize];
    ["Offset of field: cs_di_sparse::n"][::std::mem::offset_of!(cs_di_sparse, n) - 8usize];
    ["Offset of field: cs_di_sparse::p"][::std::mem::offset_of!(cs_di_sparse, p) - 16usize];
    ["Offset of field: cs_di_sparse::i"][::std::mem::offset_of!(cs_di_sparse, i) - 24usize];
    ["Offset of field: cs_di_sparse::x"][::std::mem::offset_of!(cs_di_sparse, x) - 32usize];
    ["Offset of field: cs_di_sparse::nz"][::std::mem::offset_of!(cs_di_sparse, nz) - 40usize];
};
pub type cs_di = cs_di_sparse;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_di_symbolic {
    pub pinv: *mut i32,
    pub q: *mut i32,
    pub parent: *mut i32,
    pub cp: *mut i32,
    pub leftmost: *mut i32,
    pub m2: i32,
    pub lnz: f64,
    pub unz: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cs_di_symbolic"][::std::mem::size_of::<cs_di_symbolic>() - 64usize];
    ["Alignment of cs_di_symbolic"][::std::mem::align_of::<cs_di_symbolic>() - 8usize];
    ["Offset of field: cs_di_symbolic::pinv"]
        [::std::mem::offset_of!(cs_di_symbolic, pinv) - 0usize];
    ["Offset of field: cs_di_symbolic::q"][::std::mem::offset_of!(cs_di_symbolic, q) - 8usize];
    ["Offset of field: cs_di_symbolic::parent"]
        [::std::mem::offset_of!(cs_di_symbolic, parent) - 16usize];
    ["Offset of field: cs_di_symbolic::cp"][::std::mem::offset_of!(cs_di_symbolic, cp) - 24usize];
    ["Offset of field: cs_di_symbolic::leftmost"]
        [::std::mem::offset_of!(cs_di_symbolic, leftmost) - 32usize];
    ["Offset of field: cs_di_symbolic::m2"][::std::mem::offset_of!(cs_di_symbolic, m2) - 40usize];
    ["Offset of field: cs_di_symbolic::lnz"][::std::mem::offset_of!(cs_di_symbolic, lnz) - 48usize];
    ["Offset of field: cs_di_symbolic::unz"][::std::mem::offset_of!(cs_di_symbolic, unz) - 56usize];
};
pub type cs_dis = cs_di_symbolic;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_di_numeric {
    pub L: *mut cs_di,
    pub U: *mut cs_di,
    pub pinv: *mut i32,
    pub B: *mut f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cs_di_numeric"][::std::mem::size_of::<cs_di_numeric>() - 32usize];
    ["Alignment of cs_di_numeric"][::std::mem::align_of::<cs_di_numeric>() - 8usize];
    ["Offset of field: cs_di_numeric::L"][::std::mem::offset_of!(cs_di_numeric, L) - 0usize];
    ["Offset of field: cs_di_numeric::U"][::std::mem::offset_of!(cs_di_numeric, U) - 8usize];
    ["Offset of field: cs_di_numeric::pinv"][::std::mem::offset_of!(cs_di_numeric, pinv) - 16usize];
    ["Offset of field: cs_di_numeric::B"][::std::mem::offset_of!(cs_di_numeric, B) - 24usize];
};
pub type cs_din = cs_di_numeric;
unsafe extern "C" {
    pub fn css_init(A: *const cs_di) -> *mut cs_dis;
}
unsafe extern "C" {
    pub fn csn_init(A: *const cs_di, S: *const cs_dis) -> *mut cs_din;
}
unsafe extern "C" {
    pub fn csparse_solve(
        S: *const cs_dis,
        N: *const cs_din,
        n: ::std::os::raw::c_int,
        rhs: *const f64,
        y: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn csparse_matvec(A: *const cs_di, rhs: *const f64, y: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn csparse_matmat(A: *const cs_di, B: *const cs_di) -> *mut cs_di;
}
